---
kind: other
id: Properties.T:Autodesk.Revit.DB.Architecture.BuildingPad
source: html/c86fb557-1882-93de-b8d9-66e064d85d0d.htm
---
# BuildingPad Properties

The id of the assembly instance to which the element belongs.